.outdated/shared/output/load-15-2025-10-26-20-29-50/k6-test-reddit.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

time="2025-10-26T20:29:50+01:00" level=info msg="CSV LOCATION:  /Users/urosceh/Code/zilla-minikube/shared/passwords/reddit/reddit.csv" source=console
time="2025-10-26T20:29:50+01:00" level=info msg="[reddit] Loaded 200 users from CSV" source=console
time="2025-10-26T20:29:50+01:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""
     execution: local
        script: /Users/urosceh/Code/zilla-minikube/shared/k6/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-10-26T20:29:50+01:00" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: address already in use"
time="2025-10-26T20:29:50+01:00" level=info msg="[reddit] LOAD TEST SETUP" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:52+01:00" level=info msg="[reddit] Admin token obtained" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:53+01:00" level=info msg="[reddit] Created 20 projects" source=console
time="2025-10-26T20:29:54+01:00" level=info msg="Created 5 sprints for project LDT0" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:56+01:00" level=info msg="Created 50 issues for project LDT0" source=console
time="2025-10-26T20:29:56+01:00" level=info msg="Granting access for project LDT0 0. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:57+01:00" level=info msg="Granted access for project LDT0 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:58+01:00" level=info msg="Created 5 sprints for project LDT1" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:59+01:00" level=info msg="Created 50 issues for project LDT1" source=console
time="2025-10-26T20:29:59+01:00" level=info msg="Granting access for project LDT1 1. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:00+01:00" level=info msg="Granted access for project LDT1 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:01+01:00" level=info msg="Created 5 sprints for project LDT2" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:02+01:00" level=info msg="Created 50 issues for project LDT2" source=console
time="2025-10-26T20:30:02+01:00" level=info msg="Granting access for project LDT2 2. 10 users" source=console
time="2025-10-26T20:30:03+01:00" level=info msg="Granted access for project LDT2 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:04+01:00" level=info msg="Created 5 sprints for project LDT3" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:05+01:00" level=info msg="Created 50 issues for project LDT3" source=console
time="2025-10-26T20:30:05+01:00" level=info msg="Granting access for project LDT3 3. 10 users" source=console
time="2025-10-26T20:30:06+01:00" level=info msg="Granted access for project LDT3 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:07+01:00" level=info msg="Created 5 sprints for project LDT4" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:08+01:00" level=info msg="Created 50 issues for project LDT4" source=console
time="2025-10-26T20:30:08+01:00" level=info msg="Granting access for project LDT4 4. 10 users" source=console
time="2025-10-26T20:30:09+01:00" level=info msg="Granted access for project LDT4 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:10+01:00" level=info msg="Created 5 sprints for project LDT5" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:11+01:00" level=info msg="Created 50 issues for project LDT5" source=console
time="2025-10-26T20:30:11+01:00" level=info msg="Granting access for project LDT5 5. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:12+01:00" level=info msg="Granted access for project LDT5 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:13+01:00" level=info msg="Created 5 sprints for project LDT6" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:14+01:00" level=info msg="Created 50 issues for project LDT6" source=console
time="2025-10-26T20:30:14+01:00" level=info msg="Granting access for project LDT6 6. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:15+01:00" level=info msg="Granted access for project LDT6 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:16+01:00" level=info msg="Created 5 sprints for project LDT7" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:17+01:00" level=info msg="Created 50 issues for project LDT7" source=console
time="2025-10-26T20:30:17+01:00" level=info msg="Granting access for project LDT7 7. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:18+01:00" level=info msg="Granted access for project LDT7 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:18+01:00" level=info msg="Created 5 sprints for project LDT8" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:20+01:00" level=info msg="Created 50 issues for project LDT8" source=console
time="2025-10-26T20:30:20+01:00" level=info msg="Granting access for project LDT8 8. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:21+01:00" level=info msg="Granted access for project LDT8 to 10 users" source=console
time="2025-10-26T20:30:21+01:00" level=info msg="Created 5 sprints for project LDT9" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:23+01:00" level=info msg="Created 50 issues for project LDT9" source=console
time="2025-10-26T20:30:23+01:00" level=info msg="Granting access for project LDT9 9. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:23+01:00" level=info msg="Granted access for project LDT9 to 10 users" source=console
time="2025-10-26T20:30:24+01:00" level=info msg="Created 5 sprints for project LDT10" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:26+01:00" level=info msg="Created 50 issues for project LDT10" source=console
time="2025-10-26T20:30:26+01:00" level=info msg="Granting access for project LDT10 10. 10 users" source=console
time="2025-10-26T20:30:26+01:00" level=info msg="Granted access for project LDT10 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:27+01:00" level=info msg="Created 5 sprints for project LDT11" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:28+01:00" level=info msg="Created 50 issues for project LDT11" source=console
time="2025-10-26T20:30:28+01:00" level=info msg="Granting access for project LDT11 11. 10 users" source=console
time="2025-10-26T20:30:29+01:00" level=info msg="Granted access for project LDT11 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:30+01:00" level=info msg="Created 5 sprints for project LDT12" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:32+01:00" level=info msg="Created 50 issues for project LDT12" source=console
time="2025-10-26T20:30:32+01:00" level=info msg="Granting access for project LDT12 12. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:32+01:00" level=info msg="Granted access for project LDT12 to 10 users" source=console
time="2025-10-26T20:30:33+01:00" level=info msg="Created 5 sprints for project LDT13" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:35+01:00" level=info msg="Created 50 issues for project LDT13" source=console
time="2025-10-26T20:30:35+01:00" level=info msg="Granting access for project LDT13 13. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:36+01:00" level=info msg="Granted access for project LDT13 to 10 users" source=console
time="2025-10-26T20:30:36+01:00" level=info msg="Created 5 sprints for project LDT14" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:38+01:00" level=info msg="Created 50 issues for project LDT14" source=console
time="2025-10-26T20:30:38+01:00" level=info msg="Granting access for project LDT14 14. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:39+01:00" level=info msg="Granted access for project LDT14 to 10 users" source=console
time="2025-10-26T20:30:39+01:00" level=info msg="Created 5 sprints for project LDT15" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:41+01:00" level=info msg="Created 50 issues for project LDT15" source=console
time="2025-10-26T20:30:41+01:00" level=info msg="Granting access for project LDT15 15. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:41+01:00" level=info msg="Granted access for project LDT15 to 10 users" source=console
time="2025-10-26T20:30:42+01:00" level=info msg="Created 5 sprints for project LDT16" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:44+01:00" level=info msg="Created 50 issues for project LDT16" source=console
time="2025-10-26T20:30:44+01:00" level=info msg="Granting access for project LDT16 16. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:45+01:00" level=info msg="Granted access for project LDT16 to 10 users" source=console
time="2025-10-26T20:30:45+01:00" level=info msg="Created 5 sprints for project LDT17" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:47+01:00" level=info msg="Created 50 issues for project LDT17" source=console
time="2025-10-26T20:30:47+01:00" level=info msg="Granting access for project LDT17 17. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:48+01:00" level=info msg="Granted access for project LDT17 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:49+01:00" level=info msg="Created 5 sprints for project LDT18" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:50+01:00" level=info msg="Created 50 issues for project LDT18" source=console
time="2025-10-26T20:30:50+01:00" level=info msg="Granting access for project LDT18 18. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:52+01:00" level=info msg="Granted access for project LDT18 to 10 users" source=console
time="2025-10-26T20:30:52+01:00" level=info msg="Created 5 sprints for project LDT19" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:53+01:00" level=info msg="Created 50 issues for project LDT19" source=console
time="2025-10-26T20:30:53+01:00" level=info msg="Granting access for project LDT19 19. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:55+01:00" level=info msg="Granted access for project LDT19 to 10 users" source=console
time="2025-10-26T20:30:55+01:00" level=info msg="[reddit] Setup complete" source=console

running (1m06.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/3m00.0s

running (1m07.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m02.0s/3m00.0s

running (1m08.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m03.0s/3m00.0s

running (1m09.0s), 04/30 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 04/30 VUs  0m04.0s/3m00.0s

running (1m10.0s), 05/30 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m05.0s/3m00.0s

running (1m11.0s), 06/30 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 06/30 VUs  0m06.0s/3m00.0s

running (1m12.0s), 07/30 VUs, 6 complete and 0 interrupted iterations
default   [   4% ] 07/30 VUs  0m07.0s/3m00.0s

running (1m13.0s), 08/30 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 08/30 VUs  0m08.0s/3m00.0s

running (1m14.0s), 09/30 VUs, 11 complete and 0 interrupted iterations
default   [   5% ] 09/30 VUs  0m09.0s/3m00.0s

running (1m15.0s), 10/30 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 10/30 VUs  0m10.0s/3m00.0s

running (1m16.0s), 11/30 VUs, 17 complete and 0 interrupted iterations
default   [   6% ] 11/30 VUs  0m11.0s/3m00.0s

running (1m17.0s), 12/30 VUs, 19 complete and 0 interrupted iterations
default   [   7% ] 12/30 VUs  0m12.0s/3m00.0s

running (1m18.0s), 13/30 VUs, 23 complete and 0 interrupted iterations
default   [   7% ] 13/30 VUs  0m13.0s/3m00.0s

running (1m19.0s), 14/30 VUs, 29 complete and 0 interrupted iterations
default   [   8% ] 14/30 VUs  0m14.0s/3m00.0s

running (1m20.0s), 15/30 VUs, 32 complete and 0 interrupted iterations
default   [   8% ] 15/30 VUs  0m15.0s/3m00.0s

running (1m21.0s), 16/30 VUs, 39 complete and 0 interrupted iterations
default   [   9% ] 16/30 VUs  0m16.0s/3m00.0s

running (1m22.0s), 17/30 VUs, 42 complete and 0 interrupted iterations
default   [   9% ] 17/30 VUs  0m17.0s/3m00.0s

running (1m23.0s), 18/30 VUs, 45 complete and 0 interrupted iterations
default   [  10% ] 18/30 VUs  0m18.0s/3m00.0s

running (1m24.0s), 19/30 VUs, 53 complete and 0 interrupted iterations
default   [  11% ] 19/30 VUs  0m19.0s/3m00.0s

running (1m25.0s), 20/30 VUs, 56 complete and 0 interrupted iterations
default   [  11% ] 20/30 VUs  0m20.0s/3m00.0s

running (1m26.0s), 21/30 VUs, 61 complete and 0 interrupted iterations
default   [  12% ] 21/30 VUs  0m21.0s/3m00.0s

running (1m27.0s), 22/30 VUs, 64 complete and 0 interrupted iterations
default   [  12% ] 22/30 VUs  0m22.0s/3m00.0s

running (1m28.0s), 23/30 VUs, 70 complete and 0 interrupted iterations
default   [  13% ] 23/30 VUs  0m23.0s/3m00.0s

running (1m29.0s), 24/30 VUs, 73 complete and 0 interrupted iterations
default   [  13% ] 24/30 VUs  0m24.0s/3m00.0s

running (1m30.0s), 25/30 VUs, 82 complete and 0 interrupted iterations
default   [  14% ] 25/30 VUs  0m25.0s/3m00.0s

running (1m31.0s), 26/30 VUs, 88 complete and 0 interrupted iterations
default   [  14% ] 26/30 VUs  0m26.0s/3m00.0s

running (1m32.0s), 27/30 VUs, 94 complete and 0 interrupted iterations
default   [  15% ] 27/30 VUs  0m27.0s/3m00.0s

running (1m33.0s), 28/30 VUs, 100 complete and 0 interrupted iterations
default   [  16% ] 28/30 VUs  0m28.0s/3m00.0s

running (1m34.0s), 29/30 VUs, 106 complete and 0 interrupted iterations
default   [  16% ] 29/30 VUs  0m29.0s/3m00.0s

running (1m35.0s), 29/30 VUs, 114 complete and 0 interrupted iterations
default   [  17% ] 29/30 VUs  0m30.0s/3m00.0s

running (1m36.0s), 30/30 VUs, 118 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m31.0s/3m00.0s

running (1m37.0s), 30/30 VUs, 127 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m32.0s/3m00.0s

running (1m38.0s), 30/30 VUs, 132 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m33.0s/3m00.0s

running (1m39.0s), 30/30 VUs, 139 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m34.0s/3m00.0s

running (1m40.0s), 30/30 VUs, 146 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m35.0s/3m00.0s

running (1m41.0s), 30/30 VUs, 156 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m36.0s/3m00.0s

running (1m42.0s), 30/30 VUs, 163 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m37.0s/3m00.0s

running (1m43.0s), 30/30 VUs, 167 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m38.0s/3m00.0s

running (1m44.0s), 30/30 VUs, 176 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m39.0s/3m00.0s

running (1m45.0s), 30/30 VUs, 184 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m40.0s/3m00.0s

running (1m46.0s), 30/30 VUs, 193 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m41.0s/3m00.0s

running (1m47.0s), 30/30 VUs, 198 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m42.0s/3m00.0s

running (1m48.0s), 30/30 VUs, 204 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m43.0s/3m00.0s

running (1m49.0s), 30/30 VUs, 217 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m44.0s/3m00.0s

running (1m50.0s), 30/30 VUs, 219 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m45.0s/3m00.0s

running (1m51.0s), 30/30 VUs, 227 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m46.0s/3m00.0s

running (1m52.0s), 30/30 VUs, 235 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m47.0s/3m00.0s

running (1m53.0s), 30/30 VUs, 243 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m48.0s/3m00.0s

running (1m54.0s), 30/30 VUs, 249 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m49.0s/3m00.0s

running (1m55.0s), 30/30 VUs, 256 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m50.0s/3m00.0s

running (1m56.0s), 30/30 VUs, 265 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m51.0s/3m00.0s

running (1m57.0s), 30/30 VUs, 274 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m52.0s/3m00.0s

running (1m58.0s), 30/30 VUs, 281 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m53.0s/3m00.0s

running (1m59.0s), 30/30 VUs, 289 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m54.0s/3m00.0s

running (2m00.0s), 30/30 VUs, 300 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m55.0s/3m00.0s

running (2m01.0s), 30/30 VUs, 309 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m56.0s/3m00.0s

running (2m02.0s), 30/30 VUs, 316 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m57.0s/3m00.0s

running (2m03.0s), 30/30 VUs, 325 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m58.0s/3m00.0s

running (2m04.0s), 30/30 VUs, 335 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  0m59.0s/3m00.0s

running (2m05.0s), 30/30 VUs, 343 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m00.0s/3m00.0s

running (2m06.0s), 30/30 VUs, 352 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m01.0s/3m00.0s

running (2m07.0s), 30/30 VUs, 367 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m02.0s/3m00.0s

running (2m08.0s), 30/30 VUs, 374 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m03.0s/3m00.0s

running (2m09.0s), 30/30 VUs, 389 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m04.0s/3m00.0s

running (2m10.0s), 30/30 VUs, 403 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m05.0s/3m00.0s

running (2m11.0s), 30/30 VUs, 411 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m06.0s/3m00.0s

running (2m12.0s), 30/30 VUs, 431 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m07.0s/3m00.0s

running (2m13.0s), 30/30 VUs, 437 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m08.0s/3m00.0s

running (2m14.0s), 30/30 VUs, 454 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m09.0s/3m00.0s

running (2m15.0s), 30/30 VUs, 468 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m10.0s/3m00.0s

running (2m16.0s), 30/30 VUs, 478 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m11.0s/3m00.0s

running (2m17.0s), 30/30 VUs, 488 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m12.0s/3m00.0s

running (2m18.0s), 30/30 VUs, 496 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m13.0s/3m00.0s

running (2m19.0s), 30/30 VUs, 507 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m14.0s/3m00.0s

running (2m20.0s), 30/30 VUs, 520 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m15.0s/3m00.0s

running (2m21.0s), 30/30 VUs, 529 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m16.0s/3m00.0s

running (2m22.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m17.0s/3m00.0s

running (2m23.0s), 30/30 VUs, 549 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m18.0s/3m00.0s

running (2m24.0s), 30/30 VUs, 563 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m19.0s/3m00.0s

running (2m25.0s), 30/30 VUs, 575 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m20.0s/3m00.0s

running (2m26.0s), 30/30 VUs, 584 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m21.0s/3m00.0s

running (2m27.0s), 30/30 VUs, 600 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m22.0s/3m00.0s

running (2m28.0s), 30/30 VUs, 609 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m23.0s/3m00.0s

running (2m29.0s), 30/30 VUs, 625 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m24.0s/3m00.0s

running (2m30.0s), 30/30 VUs, 637 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m25.0s/3m00.0s

running (2m31.0s), 30/30 VUs, 645 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m26.0s/3m00.0s

running (2m32.0s), 30/30 VUs, 662 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m27.0s/3m00.0s

running (2m33.0s), 30/30 VUs, 672 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m28.0s/3m00.0s

running (2m34.0s), 30/30 VUs, 686 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m29.0s/3m00.0s

running (2m35.0s), 30/30 VUs, 691 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m30.0s/3m00.0s

running (2m36.0s), 30/30 VUs, 702 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m31.0s/3m00.0s

running (2m37.0s), 30/30 VUs, 717 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m32.0s/3m00.0s

running (2m38.0s), 30/30 VUs, 728 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m33.0s/3m00.0s

running (2m39.0s), 30/30 VUs, 741 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m34.0s/3m00.0s

running (2m40.0s), 30/30 VUs, 756 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m35.0s/3m00.0s

running (2m41.0s), 30/30 VUs, 763 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m36.0s/3m00.0s

running (2m42.0s), 30/30 VUs, 769 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m37.0s/3m00.0s

running (2m43.0s), 30/30 VUs, 783 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m38.0s/3m00.0s

running (2m44.0s), 30/30 VUs, 795 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m39.0s/3m00.0s

running (2m45.0s), 30/30 VUs, 804 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m40.0s/3m00.0s

running (2m46.0s), 30/30 VUs, 820 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m41.0s/3m00.0s

running (2m47.0s), 30/30 VUs, 833 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m42.0s/3m00.0s

running (2m48.0s), 30/30 VUs, 843 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m43.0s/3m00.0s

running (2m49.0s), 30/30 VUs, 853 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m44.0s/3m00.0s

running (2m50.0s), 30/30 VUs, 864 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m45.0s/3m00.0s

running (2m51.0s), 30/30 VUs, 876 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m46.0s/3m00.0s

running (2m52.0s), 30/30 VUs, 890 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m47.0s/3m00.0s

running (2m53.0s), 30/30 VUs, 900 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m48.0s/3m00.0s

running (2m54.0s), 30/30 VUs, 911 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m49.0s/3m00.0s

running (2m55.0s), 30/30 VUs, 922 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m50.0s/3m00.0s

running (2m56.0s), 30/30 VUs, 931 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m51.0s/3m00.0s

running (2m57.0s), 30/30 VUs, 942 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m52.0s/3m00.0s

running (2m58.0s), 30/30 VUs, 951 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m53.0s/3m00.0s

running (2m59.0s), 30/30 VUs, 960 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m54.0s/3m00.0s

running (3m00.0s), 30/30 VUs, 974 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m55.0s/3m00.0s

running (3m01.0s), 30/30 VUs, 982 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m56.0s/3m00.0s

running (3m02.0s), 30/30 VUs, 992 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m57.0s/3m00.0s

running (3m03.0s), 30/30 VUs, 1006 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m58.0s/3m00.0s

running (3m04.0s), 30/30 VUs, 1012 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m59.0s/3m00.0s

running (3m05.0s), 30/30 VUs, 1018 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m00.0s/3m00.0s

running (3m06.0s), 30/30 VUs, 1031 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m01.0s/3m00.0s

running (3m07.0s), 30/30 VUs, 1042 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m02.0s/3m00.0s

running (3m08.0s), 30/30 VUs, 1050 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m03.0s/3m00.0s

running (3m09.0s), 30/30 VUs, 1058 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m04.0s/3m00.0s

running (3m10.0s), 30/30 VUs, 1068 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m05.0s/3m00.0s

running (3m11.0s), 30/30 VUs, 1081 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m06.0s/3m00.0s

running (3m12.0s), 30/30 VUs, 1088 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m07.0s/3m00.0s

running (3m13.0s), 30/30 VUs, 1098 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m08.0s/3m00.0s

running (3m14.0s), 30/30 VUs, 1111 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m09.0s/3m00.0s

running (3m15.0s), 30/30 VUs, 1123 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m10.0s/3m00.0s

running (3m16.0s), 30/30 VUs, 1134 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m11.0s/3m00.0s

running (3m17.0s), 30/30 VUs, 1147 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m12.0s/3m00.0s

running (3m18.0s), 30/30 VUs, 1158 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m13.0s/3m00.0s

running (3m19.0s), 30/30 VUs, 1169 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m14.0s/3m00.0s

running (3m20.0s), 30/30 VUs, 1175 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m15.0s/3m00.0s

running (3m21.0s), 30/30 VUs, 1188 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m16.0s/3m00.0s

running (3m22.0s), 30/30 VUs, 1200 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m17.0s/3m00.0s

running (3m23.0s), 30/30 VUs, 1207 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m18.0s/3m00.0s

running (3m24.0s), 30/30 VUs, 1217 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m19.0s/3m00.0s

running (3m25.0s), 30/30 VUs, 1225 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m20.0s/3m00.0s

running (3m26.0s), 30/30 VUs, 1231 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m21.0s/3m00.0s

running (3m27.0s), 30/30 VUs, 1242 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m22.0s/3m00.0s

running (3m28.0s), 30/30 VUs, 1251 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m23.0s/3m00.0s

running (3m29.0s), 30/30 VUs, 1259 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m24.0s/3m00.0s

running (3m30.0s), 30/30 VUs, 1267 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m25.0s/3m00.0s

running (3m31.0s), 30/30 VUs, 1280 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m26.0s/3m00.0s

running (3m32.0s), 30/30 VUs, 1291 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m27.0s/3m00.0s

running (3m33.0s), 30/30 VUs, 1304 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m28.0s/3m00.0s

running (3m34.0s), 30/30 VUs, 1317 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m29.0s/3m00.0s

running (3m35.0s), 30/30 VUs, 1327 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m30.0s/3m00.0s

running (3m36.0s), 30/30 VUs, 1345 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m31.0s/3m00.0s

running (3m37.0s), 30/30 VUs, 1350 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m32.0s/3m00.0s

running (3m38.0s), 29/30 VUs, 1363 complete and 0 interrupted iterations
default   [  85% ] 29/30 VUs  2m33.0s/3m00.0s

running (3m39.0s), 28/30 VUs, 1376 complete and 0 interrupted iterations
default   [  86% ] 28/30 VUs  2m34.0s/3m00.0s

running (3m40.0s), 27/30 VUs, 1387 complete and 0 interrupted iterations
default   [  86% ] 27/30 VUs  2m35.0s/3m00.0s

running (3m41.0s), 26/30 VUs, 1401 complete and 0 interrupted iterations
default   [  87% ] 26/30 VUs  2m36.0s/3m00.0s

running (3m42.0s), 24/30 VUs, 1411 complete and 0 interrupted iterations
default   [  87% ] 24/30 VUs  2m37.0s/3m00.0s

running (3m43.0s), 24/30 VUs, 1421 complete and 0 interrupted iterations
default   [  88% ] 24/30 VUs  2m38.0s/3m00.0s

running (3m44.0s), 23/30 VUs, 1435 complete and 0 interrupted iterations
default   [  88% ] 23/30 VUs  2m39.0s/3m00.0s

running (3m45.0s), 21/30 VUs, 1446 complete and 0 interrupted iterations
default   [  89% ] 21/30 VUs  2m40.0s/3m00.0s

running (3m46.0s), 21/30 VUs, 1455 complete and 0 interrupted iterations
default   [  89% ] 21/30 VUs  2m41.0s/3m00.0s

running (3m47.0s), 19/30 VUs, 1471 complete and 0 interrupted iterations
default   [  90% ] 19/30 VUs  2m42.0s/3m00.0s

running (3m48.0s), 18/30 VUs, 1479 complete and 0 interrupted iterations
default   [  91% ] 18/30 VUs  2m43.0s/3m00.0s

running (3m49.0s), 17/30 VUs, 1494 complete and 0 interrupted iterations
default   [  91% ] 17/30 VUs  2m44.0s/3m00.0s

running (3m50.0s), 16/30 VUs, 1508 complete and 0 interrupted iterations
default   [  92% ] 16/30 VUs  2m45.0s/3m00.0s

running (3m51.0s), 15/30 VUs, 1520 complete and 0 interrupted iterations
default   [  92% ] 15/30 VUs  2m46.0s/3m00.0s

running (3m52.0s), 14/30 VUs, 1535 complete and 0 interrupted iterations
default   [  93% ] 14/30 VUs  2m47.0s/3m00.0s

running (3m53.0s), 13/30 VUs, 1546 complete and 0 interrupted iterations
default   [  93% ] 13/30 VUs  2m48.0s/3m00.0s

running (3m54.0s), 12/30 VUs, 1561 complete and 0 interrupted iterations
default   [  94% ] 12/30 VUs  2m49.0s/3m00.0s

running (3m55.0s), 11/30 VUs, 1574 complete and 0 interrupted iterations
default   [  94% ] 11/30 VUs  2m50.0s/3m00.0s

running (3m56.0s), 10/30 VUs, 1589 complete and 0 interrupted iterations
default   [  95% ] 10/30 VUs  2m51.0s/3m00.0s

running (3m57.0s), 09/30 VUs, 1601 complete and 0 interrupted iterations
default   [  96% ] 09/30 VUs  2m52.0s/3m00.0s

running (3m58.0s), 08/30 VUs, 1616 complete and 0 interrupted iterations
default   [  96% ] 08/30 VUs  2m53.0s/3m00.0s

running (3m59.0s), 07/30 VUs, 1630 complete and 0 interrupted iterations
default   [  97% ] 07/30 VUs  2m54.0s/3m00.0s

running (4m00.0s), 06/30 VUs, 1648 complete and 0 interrupted iterations
default   [  97% ] 06/30 VUs  2m55.0s/3m00.0s

running (4m01.0s), 05/30 VUs, 1664 complete and 0 interrupted iterations
default   [  98% ] 05/30 VUs  2m56.0s/3m00.0s

running (4m02.0s), 04/30 VUs, 1682 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m57.0s/3m00.0s

running (4m03.0s), 03/30 VUs, 1696 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m58.0s/3m00.0s

running (4m04.0s), 02/30 VUs, 1704 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m59.0s/3m00.0s

running (4m05.0s), 01/30 VUs, 1734 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  3m00.0s/3m00.0s
time="2025-10-26T20:33:55+01:00" level=info msg="[reddit] Load test completed" source=console


  █ THRESHOLDS 

    http_req_duration{phase:test}
    ✗ 'p(95)<300' p(95)=2.01s
    ✗ 'p(99)<500' p(99)=2.5s

    http_req_failed
    ✗ 'rate<0.01' rate=5.96%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=904.8ms  min=4.9ms   med=897.43ms max=29.19s p(90)=1.79s p(95)=1.96s
      { expected_response:true }...: avg=918.71ms min=4.9ms   med=911.37ms max=29.19s p(90)=1.8s  p(95)=1.97s
      { phase:test }...............: avg=1.21s    min=4.9ms   med=1.07s    max=29.19s p(90)=1.86s p(95)=2.01s
    http_req_failed................: 5.96%  303 out of 5080
    http_reqs......................: 5080   20.73114/s

    EXECUTION
    iteration_duration.............: avg=2.6s     min=13.53ms med=2.51s    max=31.94s p(90)=4.3s  p(95)=4.81s
    iterations.....................: 1737   7.088581/s
    vus............................: 1      min=0           max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 5.8 MB 24 kB/s
    data_sent......................: 2.2 MB 9.0 kB/s



running (4m05.0s), 00/30 VUs, 1737 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  3m0s
time="2025-10-26T20:33:56+01:00" level=error msg="thresholds on metrics 'http_req_duration{phase:test}, http_req_failed' have been crossed"